-- Очистка таблицы
DELETE FROM [PickupPoint];
DBCC CHECKIDENT ('[PickupPoint]', RESEED, 0);

-- Вставка пунктов выдачи
INSERT INTO [PickupPoint] (
    [Name],
    [Address],
    [PhoneNumber]
)
VALUES 
    (
        'Центральный магазин',
        'пр. Независимости 65, Минск',
        '+375291234567'
    ),
    (
        'ТЦ Столица',
        'пр. Независимости 3-2, Минск',
        '+375292345678'
    ),
    (
        'Авторынок Ждановичи',
        'Тимирязева 127/1, Минск',
        '+375293456789'
    ),
    (
        'Магазин на Уманской',
        'ул. Уманская 54, Минск',
        '+375294567890'
    ),
    (
        'Пункт выдачи Малиновка',
        'ул. Есенина 36, Минск',
        '+375295678901'
    ),
    (
        'Магазин в Гомеле',
        'ул. Советская 29, Гомель',
        '+375296789012'
    ),
    (
        'Пункт выдачи Брест',
        'ул. Московская 275А, Брест',
        '+375297890123'
    ),
    (
        'Магазин в Гродно',
        'пр. Космонавтов 81, Гродно',
        '+375298901234'
    ),
    (
        'Пункт выдачи Витебск',
        'пр. Строителей 11А, Витебск',
        '+375299012345'
    ),
    (
        'Магазин в Могилеве',
        'ул. Первомайская 48, Могилев',
        '+375291123456'
    );

-- Проверка вставленных данных
SELECT * FROM [PickupPoint];
